### 3.Pandas - kluczowy pakiet do danych tabelarycznych
- Wczytywanie danych tabelarycznych (CSV, TSV, XLS)
- Operacje na kolumnach i wierszach
- Filtrowanie i procesowanie danych
- Odczytywanie danych statystycznych
- Modyfikacja danych z użyciem funkcji pythonowych
- Agregacja, podobieństwa do SQL
- Pandas Profiling - raporty

Pandas to popularna biblioteka programistyczna w języku Python, która jest używana do manipulacji i analizy danych. Jest to potężne narzędzie, które ułatwia wczytywanie, przekształcanie, eksplorację i analizę danych w formie tabelarycznej, takich jak arkusze kalkulacyjne lub bazy danych.

##### Główne cechy i funkcje biblioteki Pandas:

1. Struktury danych: Pandas wprowadza dwie główne struktury danych: Series i DataFrame.

- Series: To jednowymiarowa tablica danych, podobna do kolumny w arkuszu kalkulacyjnym lub kolumny w bazie danych. Series można traktować jako uporządkowany zestaw danych z indeksem.

- DataFrame: To dwuwymiarowa struktura danych, która przypomina tabelę lub arkusz kalkulacyjny. DataFrame składa się z kolumn i wierszy, a każda kolumna może zawierać różne typy danych.

2. Wczytywanie i zapisywanie danych: Pandas umożliwia wczytywanie danych z różnych źródeł, takich jak pliki CSV, Excel, SQL, JSON i wiele innych. Możesz również zapisywać dane do tych formatów.

3. Indeksowanie i selekcja danych: Pandas oferuje różnorodne mechanizmy indeksowania i selekcji danych, co pozwala na dostęp do konkretnych kolumn, wierszy lub komórek danych w bardzo elastyczny sposób.

4. Operacje na danych: Biblioteka umożliwia wykonywanie różnych operacji na danych, takich jak filtrowanie, sortowanie, grupowanie, łączenie i wiele innych. Możesz także przeprowadzać operacje matematyczne na danych w sposób efektywny.

5. Obsługa brakujących danych: Pandas oferuje narzędzia do radzenia sobie z danymi brakującymi, takie jak usuwanie lub uzupełnianie brakujących wartości.

6. Analiza i eksploracja danych: Biblioteka ułatwia eksplorację danych poprzez obliczanie statystyk opisowych, generowanie wykresów i wizualizacji danych.

7. Obsługa szeregów czasowych: Pandas posiada wsparcie dla operacji na szeregach czasowych, co jest przydatne w analizie danych związanych z czasem.

8. Integracja z innymi narzędziami: Pandas można łatwo łączyć z innymi bibliotekami do analizy danych i uczenia maszynowego, takimi jak NumPy, SciPy, Matplotlib, scikit-learn i wiele innych.

9. Wsparcie społeczności: Pandas posiada aktywną społeczność użytkowników i deweloperów, co oznacza, że istnieje wiele dostępnych źródeł, tutoriali i materiałów do nauki.

##### Strona internetowa
- https://pandas.pydata.org/

##### Dokumentacja
- https://pandas.pydata.org/pandas-docs/stable/

##### Polecana strona
- https://www.dataschool.io/easier-data-analysis-with-pandas/

In [1]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\tomas\appdata\local\programs\anaconda3\envs\env_conda_3_12_7\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\tomas\appdata\local\programs\anaconda3\envs\env_conda_3_12_7\lib\site-packages (from pandas) (2.2.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\tomas\appdata\local\programs\anaconda3\envs\env_conda_3_12_7\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\tomas\appdata\local\programs\anaconda3\envs\env_conda_3_12_7\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\tomas\appdata\local\programs\anaconda3\envs\env_conda_3_12_7\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\tomas\appdata\local\programs\anaconda3\envs\env_conda_3_12_7\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
# pip install pandas

import pandas as pd
pd.__version__

'2.2.3'

### `pd.Series()` - Tablica jednowymiarowa zawierająca dane oraz ich indeksy
Series jest jednowymiarową tablicą z etykietowanym indeksem, która może przechowywać dowolny typ danych – liczby, tekst, wartości logiczne, daty itp. Jest to fundament, na którym buduje się bardziej złożone struktury danych w Pandas.

In [3]:
s = pd.Series(data=[1, 2, 3])
s

0    1
1    2
2    3
dtype: int64

In [4]:
s = pd.Series(data=[1, 2, 3], index=['a', 'b', 'c'], name='test')
s

a    1
b    2
c    3
Name: test, dtype: int64

In [ ]:
#%pip install numpy

In [12]:
import numpy as np

s = pd.Series(data=[1, np.nan, 3], index=['a', 'b', 'c'])
s

a    1.0
b    NaN
c    3.0
dtype: float64

In [14]:
s = pd.Series(data=np.arange(1, 11), index=pd.date_range(start='20241210', periods=10))
s

2024-12-10     1
2024-12-11     2
2024-12-12     3
2024-12-13     4
2024-12-14     5
2024-12-15     6
2024-12-16     7
2024-12-17     8
2024-12-18     9
2024-12-19    10
Freq: D, dtype: int64

In [8]:
s.dtypes

dtype('int64')

Atrybut z indeksami jest obiektem typu `pd.Index`:

In [15]:
s.index # często będziemy się posługiwać tą metodą

DatetimeIndex(['2024-12-10', '2024-12-11', '2024-12-12', '2024-12-13',
               '2024-12-14', '2024-12-15', '2024-12-16', '2024-12-17',
               '2024-12-18', '2024-12-19'],
              dtype='datetime64[ns]', freq='D')

In [18]:
s.values # często będziemy się posługiwać tą metodą

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

## Series vs tablica NumPy

Series uogólnia jednowymiarową tablicę NumPy:
* tablica NumPy posiada wewnętrzną indeksację w stylu Pythona (*implicit index*);
* Series posiada wewnętrzną indeksację w stylu Pythona plus indeksację za pomocą etykiet.

In [20]:
s = pd.Series([3, 1, 2.71, -10], index=['a', 'b', 'c', 'd'])
s

a     3.00
b     1.00
c     2.71
d   -10.00
dtype: float64

In [22]:
s['c']

np.float64(2.71)

Indeks etykiet może:
* nie zachowywać kolejności,
* posiadać luki,
* posiadać powtórzenia.

In [23]:
s = pd.Series(data=['python', 'sas', 'r'], name='jezyki')
s

0    python
1       sas
2         r
Name: jezyki, dtype: object

In [25]:
s = pd.Series([3, 1, 2.71, -10], index=['a', 'a', 'c', 'd'])
s

a     3.00
a     1.00
c     2.71
d   -10.00
dtype: float64

In [28]:
s['a']

a    3.0
a    1.0
dtype: float64

## Series jako rodzaj słownika

Klucze słownika przechodzą na etykiety podczas przekształcania słownika na obiekt Series:

In [29]:
ludność_dict = {'Polska': 38501,
                'Czechy': 10221,
                'Szwecja': 9045,
                'Niemcy': 82370,
                'Litwa': 3565}

ludność = pd.Series(ludność_dict)
ludność

Polska     38501
Czechy     10221
Szwecja     9045
Niemcy     82370
Litwa       3565
dtype: int64

Indeks etykiet w obiekcie Series ma niektóre cechy kluczy słownika, np. dostęp do elementu:

In [33]:
ludność['Polska']

np.int64(38501)

In [35]:
ludność.Polska

np.int64(38501)

## Selekcja elementów z obiektu Series

Obiekt Series ma równocześnie cechy słownika i jednowymiarowej tablicy. 

Niektóre wzorce dostępu do elementów naśladują te ze słownika, inne te z tablicy jednowymiarowej.

In [36]:
ludność['Czechy']

np.int64(10221)

In [37]:
'Polska' in ludność

True

In [38]:
ludność.keys()

Index(['Polska', 'Czechy', 'Szwecja', 'Niemcy', 'Litwa'], dtype='object')

In [39]:
list(ludność.items())

[('Polska', 38501),
 ('Czechy', 10221),
 ('Szwecja', 9045),
 ('Niemcy', 82370),
 ('Litwa', 3565)]

Modyfikacja w miejscu:

In [41]:
ludność['Grecja'] = 10723
ludność

Polska     38501
Czechy     10221
Szwecja     9045
Niemcy     82370
Litwa       3565
Grecja     10723
dtype: int64

In [48]:
ludność

Polska     38501
Czechy     10221
Szwecja     9045
Niemcy     82370
Litwa       3565
Grecja     10723
dtype: int64

In [46]:
list(ludność.items())

[('Polska', 38501),
 ('Czechy', 10221),
 ('Szwecja', 9045),
 ('Niemcy', 82370),
 ('Litwa', 3565),
 ('Grecja', 10723)]

In [44]:
ludność['Grecja']

np.int64(10723)

Series jako tablica jednowymiarowa pozwala na dostęp do wartości poprzez:
* wycinki,
* maskowanie,
* wymyślne indeksowanie.

In [45]:
# Wycinek indeksów z poziomu etykiet
ludność['Czechy':'Niemcy'] # Prawy kraniec zaliczony!

Czechy     10221
Szwecja     9045
Niemcy     82370
dtype: int64

In [49]:
# Wycinek wewnętrznych indeksów Pythona
ludność[1:3] # Prawie kraniec wykluczony!

Czechy     10221
Szwecja     9045
dtype: int64

In [50]:
# Maskowanie
ludność[(10000 < ludność) & (ludność < 40000)]

Polska    38501
Czechy    10221
Grecja    10723
dtype: int64

In [51]:
# Indeksowanie wymyślne (fancy indexing), indeks etykiet
ludność[['Czechy', 'Grecja', 'Litwa']]

Czechy    10221
Grecja    10723
Litwa      3565
dtype: int64

In [52]:
# Indeksowanie wymyślne (fancy indexing), indeks wewnętrzny Pythona
ludność[[2, 4, 2]]

C:\Users\tomas\AppData\Local\Temp\ipykernel_28876\176246164.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ludność[[2, 4, 2]]

Szwecja    9045
Litwa      3565
Szwecja    9045
dtype: int64

In [53]:
ludność.iloc[[2, 4, 2]]

Szwecja    9045
Litwa      3565
Szwecja    9045
dtype: int64

## Zagadka

In [54]:
s = pd.Series(['a', 'b', 'c'], index=[1, 2, 3])
s

1    a
2    b
3    c
dtype: object

Jaka wartość kryje się pod `s[2]`? Co zwróci `s[1:3]`?

In [55]:
s[2]

'b'

In [56]:
s[1:3] # Ale wycinek po indeksach wewnętrznych.

2    b
3    c
dtype: object

## Indeksery `loc`, `iloc`

* Atrybut `loc` zawsze odnosi się do indeksów z poziomu etykiet.
* Atrybut `iloc` zawsze odnosi się do indeksów wewnętrznych Pythona, czyli do zwykłej numeracji całkowitoliczbowej od zera w górę.

In [57]:
s = pd.Series(['a', 'b', 'c'], index=[1, 2, 3])
s

1    a
2    b
3    c
dtype: object

In [64]:
s.loc[1]

'a'

In [65]:
s.iloc[1]

'b'

In [66]:
s.loc[1:3] # Włącza prawy kraniec!

1    a
2    b
3    c
dtype: object

In [70]:
s.iloc[0:2] # Wyklucza prawy kraniec!

1    a
2    b
dtype: object

#Statystyki

In [79]:
ceny_akcji = pd.Series(data={'Orlen': 70, 'PZU': 30, 'KGHM': 100, 'PKP': np.nan})
ceny_akcji

Orlen     70.0
PZU       30.0
KGHM     100.0
PKP        NaN
dtype: float64

In [72]:
ceny_akcji['Orlen']

np.int64(70)

In [73]:
ceny_akcji[0]

C:\Users\tomas\AppData\Local\Temp\ipykernel_28876\2494375627.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ceny_akcji[0]

np.int64(70)

In [74]:
ceny_akcji.iloc[0]

np.int64(70)

In [80]:
ceny_akcji.count()

np.int64(3)

In [76]:
ceny_akcji.value_counts()

70     1
30     1
100    1
Name: count, dtype: int64

In [77]:
ceny_akcji.sum()

np.int64(200)

In [78]:
ceny_akcji.min()

np.int64(30)

In [81]:
ceny_akcji.describe()

count      3.000000
mean      66.666667
std       35.118846
min       30.000000
25%       50.000000
50%       70.000000
75%       85.000000
max      100.000000
dtype: float64

In [84]:
ceny_akcji.nlargest(2)

KGHM     100.0
Orlen     70.0
dtype: float64

In [85]:
ceny_akcji.nsmallest(2)

PZU      30.0
Orlen    70.0
dtype: float64

In [86]:
ceny_akcji.rank()

Orlen    2.0
PZU      1.0
KGHM     3.0
PKP      NaN
dtype: float64

In [89]:
ceny_akcji.sort_values(ascending=False)

KGHM     100.0
Orlen     70.0
PZU       30.0
PKP        NaN
dtype: float64

In [91]:
ceny_akcji.sort_index(ascending=False)

PZU       30.0
PKP        NaN
Orlen     70.0
KGHM     100.0
dtype: float64

## `pd.Series()`

Funkcja `pd.Series()` pozwala na tworzenie obiektów Series wg. schematu
```python
pd.Series(dane, index=index)
```
Parametr `index` jest opcjonalny, parametr `dane` może przyjmować rozmaitą postać.

### `pd.DataFrame()` - Dwuwymiarowa tabela, w której kolumnami są obiekty Series.
pd.DataFrame() jest jedną z najbardziej wszechstronnych i podstawowych struktur danych oferowanych przez bibliotekę Pandas. DataFrame to dwuwymiarowa tablica danych, która może przechowywać dane o różnych typach (liczby, tekst, wartości logiczne, daty itp.) w kolumnach. Struktura ta jest podobna do arkusza kalkulacyjnego lub tabeli relacyjnej bazy danych, co czyni ją niezwykle użyteczną do analizy danych.

**W analizie danych DataFrame jest często przedstawiana jako tabela, w której kolumny to zmienne a wiersze to obserwacje.**

In [92]:
ludność_dict = {'Polska': 38501,
                'Czechy': 10221,
                'Szwecja': 9045,
                'Niemcy': 82370,
                'Litwa': 3565}

ludność = pd.Series(ludność_dict)
ludność

Polska     38501
Czechy     10221
Szwecja     9045
Niemcy     82370
Litwa       3565
dtype: int64

In [93]:
powierzchnia_dict = {'Polska': 322.6,
                     'Czechy': 78.9,
                     'Szwecja': 450,
                     'Niemcy': 357,
                     'Litwa': 65.3}

powierzchnia = pd.Series(powierzchnia_dict)
powierzchnia

Polska     322.6
Czechy      78.9
Szwecja    450.0
Niemcy     357.0
Litwa       65.3
dtype: float64

In [94]:
kraje = pd.DataFrame({'powierzchnia': powierzchnia,
                      'ludność': ludność})
kraje

         powierzchnia  ludność
Polska          322.6    38501
Czechy           78.9    10221
Szwecja         450.0     9045
Niemcy          357.0    82370
Litwa            65.3     3565

## DataFrame uogólnia tablicę 2D NumPy

Podobnie jak Series obiekty DataFrame posiadają dwa poziomy indeksów dla wierszy: 
* wewnętrzny z numeracją liczbami całkowitymi od zera,
* zbudowany z etykiet.

In [95]:
kraje.index

Index(['Polska', 'Czechy', 'Szwecja', 'Niemcy', 'Litwa'], dtype='object')

In [96]:
kraje.columns

Index(['powierzchnia', 'ludność'], dtype='object')

In [97]:
kraje['powierzchnia']

Polska     322.6
Czechy      78.9
Szwecja    450.0
Niemcy     357.0
Litwa       65.3
Name: powierzchnia, dtype: float64

In [99]:
kraje['ludność']

Polska     38501
Czechy     10221
Szwecja     9045
Niemcy     82370
Litwa       3565
Name: ludność, dtype: int64

In [102]:
kraje.ludność

Polska     38501
Czechy     10221
Szwecja     9045
Niemcy     82370
Litwa       3565
Name: ludność, dtype: int64

In [101]:
kraje[kraje.index == 'Polska']

        powierzchnia  ludność
Polska         322.6    38501

In [103]:
kraje

         powierzchnia  ludność
Polska          322.6    38501
Czechy           78.9    10221
Szwecja         450.0     9045
Niemcy          357.0    82370
Litwa            65.3     3565

In [104]:
kraje['gestosc zaludnienia'] = kraje['ludność'] / kraje['powierzchnia']
kraje

         powierzchnia  ludność  gestosc zaludnienia
Polska          322.6    38501           119.345939
Czechy           78.9    10221           129.543726
Szwecja         450.0     9045            20.100000
Niemcy          357.0    82370           230.728291
Litwa            65.3     3565            54.594181

In [105]:
kraje.values

array([[3.22600000e+02, 3.85010000e+04, 1.19345939e+02],
       [7.89000000e+01, 1.02210000e+04, 1.29543726e+02],
       [4.50000000e+02, 9.04500000e+03, 2.01000000e+01],
       [3.57000000e+02, 8.23700000e+04, 2.30728291e+02],
       [6.53000000e+01, 3.56500000e+03, 5.45941807e+01]])

In [106]:
kraje.iloc[:3, :2] # Pierwsze trzy rzędy, pierwsze dwie kolumny.

         powierzchnia  ludność
Polska          322.6    38501
Czechy           78.9    10221
Szwecja         450.0     9045

In [111]:
kraje['gestosc zaludnienia']

Polska     119.345939
Czechy     129.543726
Szwecja     20.100000
Niemcy     230.728291
Litwa       54.594181
Name: gestosc zaludnienia, dtype: float64

In [108]:
# Maskowanie
kraje[(kraje.powierzchnia > 100) & (kraje['gestosc zaludnienia'] < 200)]

         powierzchnia  ludność  gestosc zaludnienia
Polska          322.6    38501           119.345939
Szwecja         450.0     9045            20.100000

In [113]:
# Wymyślne indeksowanie dla kolumn.
kraje[['powierzchnia', 'gestosc zaludnienia']]

         powierzchnia  gestosc zaludnienia
Polska          322.6           119.345939
Czechy           78.9           129.543726
Szwecja         450.0            20.100000
Niemcy          357.0           230.728291
Litwa            65.3            54.594181

In [114]:
# Wymyślne indeksowanie dla indeksów z poziomu etykiet.
kraje.loc[['Litwa', 'Polska'], ['ludność']]

        ludność
Litwa      3565
Polska    38501

In [115]:
kraje.describe()

       powierzchnia       ludność  gestosc zaludnienia
count      5.000000      5.000000             5.000000
mean     254.760000  28740.400000           110.862428
std      173.202029  32924.462908            80.920826
min       65.300000   3565.000000            20.100000
25%       78.900000   9045.000000            54.594181
50%      322.600000  10221.000000           119.345939
75%      357.000000  38501.000000           129.543726
max      450.000000  82370.000000           230.728291

In [116]:
kraje.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Polska to Litwa
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   powierzchnia         5 non-null      float64
 1   ludność              5 non-null      int64
 2   gestosc zaludnienia  5 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 332.0+ bytes

### usuwanie kolumny

In [123]:
# # DEL
# del kraje['gestosc zaludnienia']

# drop
kraje.drop('gestosc zaludnienia', axis=1, inplace=True)

In [124]:
kraje

         powierzchnia  ludność
Polska          322.6    38501
Czechy           78.9    10221
Szwecja         450.0     9045
Niemcy          357.0    82370
Litwa            65.3     3565

In [126]:
kraje.drop('Litwa')

         powierzchnia  ludność
Polska          322.6    38501
Czechy           78.9    10221
Szwecja         450.0     9045
Niemcy          357.0    82370

In [127]:
kraje

         powierzchnia  ludność
Polska          322.6    38501
Czechy           78.9    10221
Szwecja         450.0     9045
Niemcy          357.0    82370
Litwa            65.3     3565

In [129]:
kraje[kraje.index != 'Niemcy']

         powierzchnia  ludność
Polska          322.6    38501
Czechy           78.9    10221
Szwecja         450.0     9045
Litwa            65.3     3565

#### Braki danych

In [131]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [132]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [135]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      float64
 1   B       1 non-null      float64
 2   C       3 non-null      int64
dtypes: float64(2), int64(1)
memory usage: 204.0 bytes

In [134]:
df.isna().sum()

A    1
B    2
C    0
dtype: int64

In [136]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [137]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [138]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [141]:
df.fillna('BRAK')

      A     B  C
0   1.0   5.0  1
1   2.0  BRAK  2
2  BRAK  BRAK  3

In [147]:
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [143]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [146]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [153]:
df['B'].iloc[2] = 8

C:\Users\tomas\AppData\Local\Temp\ipykernel_28876\3281058248.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['B'].iloc[2] = 8

In [154]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  8.0  3

In [155]:
df['B'].fillna(df['B'].mean(), inplace=True)

In [156]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  6.5  2
2  NaN  8.0  3

In [158]:
df = pd.DataFrame({'A':[1,2,np.nan,3],
                  'B':[5,np.nan,8, 12],
                  'C':[1,2,3,4]})

In [159]:
df

     A     B  C
0  1.0   5.0  1
1  2.0   NaN  2
2  NaN   8.0  3
3  3.0  12.0  4

In [167]:
df['B']

0     5.0
1     NaN
2     8.0
3    12.0
Name: B, dtype: float64

In [168]:
df

     A     B  C
0  1.0   5.0  1
1  2.0   NaN  2
2  NaN   8.0  3
3  3.0  12.0  4

### Grupowanie (group by)

In [173]:
# Tworzymy ramkę danych
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [176]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [177]:
df.dtypes

Company    object
Person     object
Sales       int64
dtype: object

In [180]:
df.groupby('Company').mean(numeric_only=True)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [186]:
by_comp = df.groupby("Company")
by_comp

In [187]:
by_comp.std(numeric_only=True)

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [188]:
by_comp.min(numeric_only=True)

         Sales
Company
FB         243
GOOG       120
MSFT       124

In [189]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [191]:
by_comp.describe().T

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [194]:
by_comp.describe().transpose()['GOOG'].iloc[1]

np.float64(160.0)

### Daty - pd.Timestamp()
https://docs.python.org/3/library/datetime.html

In [231]:
data = pd.Timestamp.today()
data

Timestamp('2024-12-10 12:12:06.248047')

In [197]:
'2024-06-11'

'2024-06-11'

In [198]:
pd.Timestamp('2024-06-11')

Timestamp('2024-06-11 00:00:00')

In [238]:
przykład1 = pd.Timestamp.today()
przykład1.floor('M')

C:\Users\tomas\AppData\Local\Temp\ipykernel_28876\1655405410.py:2: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  przykład1.floor('M')

ValueError: <MonthEnd> is a non-fixed frequency

In [240]:
przykład1.day

10

In [241]:
luty = 28

In [243]:
f'{przykład1.day}-{luty}'

'10-28'

In [206]:
data.year

2024

In [202]:
type(data)

pandas._libs.tslibs.timestamps.Timestamp

In [228]:
data.strftime(format='%Y-%m-%d')

'2024-12-10'

In [230]:
pd.Series(data.strftime(format='%Y-%m-%d')).to_excel('test.xlsx')

In [207]:
data_dzis = data.strftime(format='%Y%m%d')

In [208]:
data_dzis

'20241210'

In [218]:
# zapis do Excela dowolnych statystyk z dzisiejszą datą

In [222]:
%pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

In [224]:
df.groupby('Company').describe().to_excel(f'statystyki_{data_dzis}.xlsx')

### przykład:

In [244]:
import pandas as pd

# Przykładowe dane
data = {'dates': ['2024-01-15', '2024-02-10', '2024-03-05']}
df = pd.DataFrame(data)
df['dates'] = pd.to_datetime(df['dates'])

# Zmiana daty na koniec miesiąca
df['end_of_month'] = df['dates'] + pd.offsets.MonthEnd(0)

In [250]:
df

       dates end_of_month
0 2024-01-15   2024-01-31
1 2024-02-10   2024-02-29
2 2024-03-05   2024-03-31

### dygresja nt. zamiana inta na string 1 na 001

In [256]:
import pandas as pd

df = pd.DataFrame({'liczby': [1, 2, 10, 100]})
df

   liczby
0       1
1       2
2      10
3     100

In [257]:
# 1 rozwiazanie
df.liczby.astype(str).str.zfill(3)

0    001
1    002
2    010
3    100
Name: liczby, dtype: object

In [258]:
df['liczby'].apply(lambda x: x*2)

0      2
1      4
2     20
3    200
Name: liczby, dtype: int64

In [259]:
df['liczby'].apply(lambda x: f'{x:03d}')

0    001
1    002
2    010
3    100
Name: liczby, dtype: object

### DYGRESJA - GIEŁDA WEEKEND

In [263]:
df

            value
2023-01-01   10.0
2023-01-02   11.0
2023-01-03    NaN
2023-01-04    NaN
2023-01-05   12.0
2023-01-06    NaN
2023-01-07    NaN
2023-01-08   13.0
2023-01-09   14.0
2023-01-10   15.0

In [265]:
import pandas as pd
import numpy as np

# Przykładowe dane
dates = pd.date_range(start='2023-01-01', end='2023-01-10')
values = [10, 11, np.nan, np.nan, 12, np.nan, np.nan, 13, 14, 15]
df = pd.DataFrame({'value': values}, index=dates)

# Uzupełnienie wartości
df_filled = df.fillna(method='ffill')

print(df_filled)

            value
2023-01-01   10.0
2023-01-02   11.0
2023-01-03   11.0
2023-01-04   11.0
2023-01-05   12.0
2023-01-06   12.0
2023-01-07   12.0
2023-01-08   13.0
2023-01-09   14.0
2023-01-10   15.0

C:\Users\tomas\AppData\Local\Temp\ipykernel_28876\46235202.py:10: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_filled = df.fillna(method='ffill')

## Łączenie danych
- https://pandas.pydata.org/docs/user_guide/merging.html

In [266]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [267]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [268]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [269]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

**Złączanie (concatenate)**

In [270]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

**Łączenie (merge)**

In [271]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [272]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [273]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [274]:
# Łączenie po kluczu
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [290]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [291]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [292]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [293]:
# Łączenie po dwóch kluczach
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [294]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K0  NaN  NaN   C3   D3
5   K2   K1   A3   B3  NaN  NaN

In [295]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [280]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [281]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

**Łączenie (join)**

In [282]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [283]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [284]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [285]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [286]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [296]:
import pandas as pd

# Przykładowe dane
df1 = pd.DataFrame({
    'key_1': ['A', 'B', 'C'],
    'key_2': [1, 2, 3],
    'value': [10, 20, 30]
})

df2 = pd.DataFrame({
    'key_1': ['A', 'B', 'C'],
    'key_2': [3, 2, 1],
    'value': [40, 50, 60]
})

# Łączenie tabel na podstawie warunku key_1 i późniejsze filtrowanie key_2
merged = pd.merge(df1, df2, on='key_1', suffixes=('_df1', '_df2'))
result = merged[merged['key_2_df1'] != merged['key_2_df2']]

print(result)

  key_1  key_2_df1  value_df1  key_2_df2  value_df2
0     A          1         10          3         40
2     C          3         30          1         60

In [297]:
df1

  key_1  key_2  value
0     A      1     10
1     B      2     20
2     C      3     30

In [298]:
df2

  key_1  key_2  value
0     A      3     40
1     B      2     50
2     C      1     60

### Operacje na ramkach danych

In [299]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [300]:
# Unikalne wartości
df['col2'].unique()

array([444, 555, 666])

In [301]:
# Liczba unikalnych wartości
df['col2'].nunique()

3

In [302]:
# Liczba poszczególnych wartości
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

***Zastosowanie funkcji***

In [303]:
def times2(x):
    return x*2

In [306]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [307]:
df['col1'].sum()

np.int64(10)

In [308]:
df['col3'].sum()

'abcdefghixyz'

In [309]:
1 + 1

2

In [310]:
'A' + 'B'

'AB'

In [311]:
df.sort_values(by='col2') #inplace=False by default

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [312]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Wczytywanie danych

In [313]:
df = pd.read_excel('data.xlsx', header=None)
# df.columns = ['DATA', 'TIMESTAMP', 'WYNIK']
df

           0         1      2
0 2024-05-21  00:00:00  123.4
1 2024-05-21  00:15:00  154.3
2 2024-05-21  00:30:00  189.5